Repository: hamza-alnaggar/Darajat
Catalog: lib/l10n/intl_*.arb
Languages: ar

# on_boarding_title_page_one
source: Learn Anytime, Anywhere
ar: تعلم أينما كنت

# on_boarding_title_page_two
source: Interactive Lessons
ar: دروس تفاعلية

# on_boarding_title_page_three
source: Learn with Top Instructors
ar: تعلّم مع أفضل المعلمين

# on_boarding_title_page_four
source: Start Your Journey Today
ar: ابدأ رحلتك الآن

# on_boarding_sub_title_page_one
source: Your smart learning platform is here to help you grow.
ar: منصتك التعليمية الذكية بانتظارك لتطوير مهاراتك.

# on_boarding_sub_title_page_two
source: Engaging and simplified lessons for all levels.
ar: محتوى ممتع، سهل، ومبسط يناسب جميع المستويات.

# on_boarding_sub_title_page_three
source: Guidance from experts and professionals throughout your journey.
ar: خبراء ومختصون يرافقونك في رحلة التعلم.

# on_boarding_sub_title_page_four
source: Join thousands of learners and achieve your goals.
ar: انضم إلى آلاف المتعلمين وحقق أهدافك التعليمية.

source: Question
ar: السؤال

# enter_answer
source: Please enter an answer
ar: الرجاء إدخال إجابة

source: Clear
ar: مسح

source: Answer
ar: الإجابة

# enter_question
source: Please enter the question
ar: الرجاء إدخال السؤال

# enter_question_hint
source: Type your question here...
ar: اكتب السؤال هنا...

source: Answers
ar: الإجابات

source: My courses
ar: الدورات الخاصة بي

source: Loading courses...
ar: جارٍ تحميل الدورات...

source: Error loading courses
ar: حدث خطأ أثناء تحميل الدورات

source: Retry
ar: إعادة المحاولة

# create_first_course
source: Create your first course to get started
ar: أنشئ أول دورة لك للبدء

source: Create Course
ar: إنشاء دورة

source: Profile
ar: الملف الشخصي

source: My courses arrange
ar: ترتيب دوراتي

# status_approved
source: Approved
ar: معتمدة

# status_draft
source: Draft
ar: مسودة

# status_pending
source: Pending
ar: قيد الانتظار

# status_rejected
source: Rejected
ar: مرفوضة

# status_deleted
source: Deleted
ar: محذوفة

# teacher_view
source: navigate to teacher view
ar: انتقل الى واجهة الاستاذ

# student_view
source: navigate to student view
ar: انتقل الى واجهة الطالب

# flame
source: Flame of Enthusiasm
ar: شعلة الحماس

# app_name
source: Darajat
ar: درجات

source: delete
ar: حذف

source: Free Courses
ar: كورسات مجانية

source: Paid Courses
ar: كورسات مدفوعة

source: All Courses
ar: جميع الكورسات

source: See All
ar: مشاهدة الكل

source: Exit App
ar: خروج

# exitAppConfirmation
source: Are you sure you want to exit?
ar: هل أنت متأكد من أنك تريد الخروج؟

source: Cancel
ar: إلغاء

source: Exit
ar: خروج

source: Categories
ar: الفئات

source: Category Courses
ar: دورات الفئة

# no_courses_in_category
source: No courses found in this category
ar: لم يتم العثور على دورات في هذه الفئة

# check_other_categories
source: Check other categories for more courses
ar: تحقق من الفئات الأخرى للمزيد من الدورات

source: Languages
ar: اللغات

source: Skills
ar: المهارات

source: Badges
ar: شارات

source: App Language
ar: لغة التطبيق

source: Become a Teacher
ar: كن معلمًا

source: Sign Out
ar: تسجيل الخروج

source: Add Language
ar: إضافة لغة

# Are_you_sure_you_want_to_upgrade
source: Are you sure you want to upgrade to a teacher account? This will give you access to create courses and manage students.
ar: هل أنت متأكد أنك تريد الترقية إلى حساب المعلم؟ سيمنحك هذا إمكانية إنشاء الدورات وإدارة الطلاب.

source: Cancel
ar: إلغاء

source: Upgrade
ar: ترقية

source: Account Upgraded!
ar: تم ترقية الحساب!

# You_are_now_a_verified_teacher
source: You're now a verified teacher. Start creating your first course!
ar: أنت الآن معلم معتمد. ابدأ في إنشاء دورتك الأولى!

source: Get Started
ar: ابدأ الآن

source: Are you sure you want to sign out?
ar: هل أنت متأكد من أنك تريد تسجيل الخروج؟

source: Discover Courses
ar: اكتشف الدورات

source: All Categories
ar: جميع الفئات

source: Search Results
ar: نتائج البحث

# search_courses_hint
source: Search courses
ar: ابحث عن الدورات

source: No courses found
ar: لم يتم العثور على دورات

# try_different_keywords
source: Try different keywords or browse categories
ar: جرب كلمات أخرى أو تصفح الفئات

source: Clear Search
ar: مسح البحث

source: Premium Courses
ar: كورسات مميزة

source: Courses
ar: الكورسات

source: Failed to load courses
ar: فشل تحميل الكورسات

source: Try Again
ar: حاول مرة أخرى

source: No courses available
ar: لا توجد كورسات متاحة

# check_back_later
source: Check back later for new courses
ar: ارجع لاحقًا للتحقق من الكورسات الجديدة

# browse_curated_collection
source: Browse our curated collection
ar: تصفح مجموعتنا المختارة

# end_of_list
source: You've reached the end
ar: لقد وصلت إلى نهاية القائمة

source: Create new account
ar: إنشاء حساب جديد

source: Login with your account
ar: تسجيل الدخول بحسابك

source: Register
ar: تسجيل

source: Already have an account ?
ar: لديك حساب بالفعل ؟

source: Login here !
ar: تسجيل الدخول من هنا ؟

source: Dont have an account ?
ar: ليس لديك حساب ؟

source: Register here !
ar: تسجيل هنا !

source: Login
ar: تسجيل دخول

source: Fist Name
ar: الاسم الأول

# last_name
source: Last Nmae
ar: الاسم الأخير

source: Email
ar: الحساب

source: Password
ar: كلمة السر

source: passwordConfirmation
ar: تأكيد كلمة السر

source: Verify Otp
ar: التحقق من الكود

source: Forget Password
ar: نسيت كلمة السر

source: Check email
ar: تحقق من الحساب

source: Check code
ar: تحقق من الرمز

source: Set password
ar: ادخل كلمة المرور

source: Change password
ar: تغير كلمة المرور

source: Password change Successfully
ar: تم تغير كلمة المرور بنجاح

source: Current password
ar: كلمة السر الحالية

# please_enter_your_current_password
source: Please enter you current password
ar: الرجاء ادخال كلمة السر الحالية

source: New password
ar: كلمة السر الجديدة

source: Confirm new password
ar: تأكيد كلمة السر الجديدة

# Passwords_do_not_match
source: password do not match
ar: كلمة السر ليست متطابقة

source: password must contain
ar: كلمة السر يجب ان تحوي

source: one special character
ar: رمز واحد خاص

source: one number
ar: رقم واحد

source: one uppercase letter
ar: حرف واحد كبير

source: at least 8 characters
ar: على الاقل 8 رموز

source: Save
ar: حفظ

# Teacher_Rules
source: Teacher Rules and Guidelines
ar: قواعد وشروط المعلم

source: Technical Quality Standards
ar: معايير الجودة الفنية

# Educational_Value
source: Educational Value and Content Quality
ar: القيمة التعليمية وجودة المحتوى

# Legal_Compliance
source: Legal and Policy Compliance
ar: الامتثال القانوني والسياسات

source: Student Engagement
ar: التفاعل مع الطلاب

# Monetization
source: Monetization (If Applicable)
ar: الربح (إذا كان مطبقًا)

# Review_Process
source: Review and Publication Process
ar: عملية المراجعة والنشر

# Accept_Rules
source: I have read and agree to all the terms and conditions
ar: لقد قرأت وأوافق على جميع الشروط والأحكام

source: Accept and Continue
ar: موافقة ومتابعة

# Rule_1_1
source: All video lessons must be recorded in High Definition (HD), with a minimum resolution of 720p.
ar: يجب تسجيل جميع الدروس بالفيديو بجودة عالية الوضوح (HD)، بدقة لا تقل عن 720 بكسل.

# Rule_1_2
source: All audio must be clear, audible, and free from background noise and distortions.
ar: يجب أن يكون الصوت واضحًا، مسموعًا، وخاليًا من الضوضاء والتشوهات.

# Rule_1_3
source: Courses must be produced using adequate equipment to ensure professional audio and video quality.
ar: يجب إنتاج الكورسات باستخدام معدات مناسبة لضمان جودة صوتية ومرئية احترافية.

# Rule_2_1
source: The course must have clear, defined learning objectives and outcomes for students.
ar: يجب أن يكون للكورس أهداف وتوقعات تعليمية واضحة ومحددة للطلاب.

# Rule_2_2
source: All course content must be original, created by you, and provide genuine educational value.
ar: يجب أن يكون جميع محتوى الكورس أصليًا، من إنشائك الخاص، ويوفر قيمة تعليمية حقيقية.

# Rule_2_3
source: The course must be well-structured with a logical sequence of modules and lessons.
ar: يجب أن يكون الكورس ذو هيكل جيد مع تسلسل منطقي للوحدات والدروس.

# Rule_3_1
source: You affirm that you own or possess the necessary legal rights to all content you publish, including videos, text, and resources.
ar: تؤكد أنك تملك أو تمتلك الحقوق القانونية اللازمة لكل المحتوى الذي تنشره، بما في ذلك مقاطع الفيديو والنصوص والموارد.

# Rule_3_2
source: You agree not to post any content that is illegal, offensive, infringes on intellectual property rights, or violates our platform's policies.
ar: توافق على عدم نشر أي محتوى غير قانوني، أو مسيء، أو ينتهك حقوق الملكية الفكرية، أو يخالف سياسات منصتنا.

# Rule_4_1
source: You commit to actively engaging with your students by responding to questions in the Q&A section within a reasonable timeframe.
ar: تلتزم بالتفاعل النشط مع طلابك من خلال الرد على الأسئلة في قسم الأسئلة والأجوبة ضمن إطار زمني معقول.

# Rule_4_2
source: You agree to consider student feedback for the continual improvement of your course content.
ar: توافق على أخذ ملاحظات الطلاب في الاعتبار للتحسين المستمر لمحتوى الكورس.

# Rule_5_1
source: If you choose to offer a paid course, you agree to the platform's revenue share model as defined in the pricing and payments policy.
ar: إذا اخترت تقديم كورس مدفوع، فأنت توافق على نموذج تقاسم الإيرادات الخاص بالمنصة كما هو محدد في سياسة التسعير والمدفوعات.

# Rule_5_2
source: The course price must be set within the allowed price tiers specified by the platform.
ar: يجب تحديد سعر الكورس ضمن الفئات السعرية المسموح بها والمحددة من قبل المنصة.

# Rule_6_1
source: You understand and accept that every course must be submitted for review and approved by the platform's administration before it is published.
ar: تفهم وتتقبل أن كل كورس يجب أن يُقدّم للمراجعة ويحصل على موافقة إدارة المنصة قبل نشره.

# Rule_6_2
source: The platform reserves the right to reject or remove any course that does not meet the quality standards or violates these terms without prior notice.
ar: تحتفظ المنصة بالحق في رفض أو إزالة أي كورس لا يستوفي معايير الجودة أو ينتهك هذه الشروط دون إشعار مسبق.
